Public Member Functions | List of all members
ACAPI::MEP::RoutingNodeDefault::Modifier Class Reference
MEP Element Manager
Modifier of the RoutingNodeDefault. More...
#include <MEPRoutingNodeDefault.hpp>
 Inheritance diagram for ACAPI::MEP::RoutingNodeDefault::Modifier:
 Public Member Functions
void  | SetElbowDefault (const ElbowDefault &elbowDefault) const
Sets the ElbowDefault to the RoutingNodeDefault.
void  | SetTransitionDefault (const TransitionDefault &transitionDefault) const
Sets the TransitionDefault to the RoutingNodeDefault.
void  | SetPreferredTransitionPlacement (PreferredTransitionPlacement preferredTransitionPlacement)
Sets the rule of the Elbow-Transition placement order of the RoutingNodeDefault.
Detailed Description
Modifier of the RoutingNodeDefault.
Member Function Documentation
◆ SetElbowDefault()
 void ACAPI::MEP::RoutingNodeDefault::Modifier::SetElbowDefault  |  ( |  const ElbowDefault & |  elbowDefault | ) |   const
Sets the ElbowDefault to the RoutingNodeDefault.
Parameters
elbowDefault | The value to be set.
◆ SetPreferredTransitionPlacement()
 void ACAPI::MEP::RoutingNodeDefault::Modifier::SetPreferredTransitionPlacement  |  ( |  PreferredTransitionPlacement |  preferredTransitionPlacement | )
Sets the rule of the Elbow-Transition placement order of the RoutingNodeDefault.
Parameters
preferredTransitionPlacement | The rule to be set.
◆ SetTransitionDefault()
 void ACAPI::MEP::RoutingNodeDefault::Modifier::SetTransitionDefault  |  ( |  const TransitionDefault & |  transitionDefault | ) |   const
Sets the TransitionDefault to the RoutingNodeDefault.
Parameters
transitionDefault | The value to be set.